app/controllers/dates_controller.rb

SELECT DISTINCT "schedules"."date" FROM "schedules"
---
  def show
    if params[:date].present?
      @date = parse_date(params[:date])
    else
      @date = Date.today
    end

    @schedules_for_start_at = Schedule.where(date: @date).order(:start_at)
    @dates = Schedule.distinct.pluck(:date).compact