app/controllers/dates_controller.rb

  def show
    if params[:date].present?
      @date = parse_date(params[:date])
    else
      @date = Date.today
    end

    @date = parse_date(params[:date])
    # @schedule = Schedule.find_by("DATE(start_at) = ?", @date)
    @schedule = Schedule.where(start_at: @date.beginning_of_day..@date.end_of_day).first

    # @schedule = Schedule.find(params[:id])
    # @schedule = Schedule.find_by(start_at: params[:date])
    @schedule = Schedule.find_by("DATE(start_at) = ?", @date)




    @schedules_for_start_at = Schedule.where(date: @date).order(:start_at)
    @dates = Schedule.distinct.pluck(:date).compact
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."date" = $1 ORDER BY "schedules"."start_at" ASC  [["date", "2024-11-24"]]
SELECT DISTINCT "schedules"."date" FROM "schedules"