app/controllers/schedules_controller.rb

  def index
    default_params = {
      start_at_gteq: Time.zone.now.beginning_of_month,
      start_at_lteq: Time.zone.now.end_of_month
    }
    if params[:date].present?
      selected_date = Date.parse(params[:date])
      @schedules_for_date = Schedule.where(date: selected_date).order(:start_at)
      @selected_date = selected_date
    else
      @schedules_for_date = Schedule.all.order(:start_at)
    end
    @schedules = Schedule.all.order(:start_at).group_by.count { |schedule| schedule.date }

    @dates = (Date.today - 7..Date.today + 7).to_a

    @q = Schedule.ransack(params[:q])
    @schedules = @q.result(distinct: true).page(params[:page]).per(10)
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."date" = $1 ORDER BY "schedules"."start_at" ASC  [["date", "2024-12-01"]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."start_at" BETWEEN $1 AND $2 ORDER BY "schedules"."start_at" ASC  [["start_at", "2024-11-24 00:00:00"], ["start_at", "2024-11-24 23:59:59.999999"]]
SELECT COUNT(DISTINCT "schedules"."id") FROM "schedules" WHERE "schedules"."start_at" >= '2024-11-01 00:00:00'
SELECT "schedules".* FROM "schedules" ORDER BY "schedules"."start_at" ASC
SELECT "schedules"."start_at" FROM "schedules"

  def create
    @schedule = Schedule.new(schedule_params)
    @schedule.date = @schedule.start_at.to_date if @schedule.start_at.present?

    if @schedule.save
---
INSERT INTO "schedules" ("destination", "start_at", "end_at", "cost", "review", "transportation", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def next_step
    @schedule = Schedule.find(params[:id])
    # 次のステップのロジックをここに記述
    if params[:commit_next] # "次へ進む" ボタンの処理
      if @schedule.save
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "schedules" SET "end_at" = $1, "updated_at" = $2 WHERE "schedules"."id" = $3  [["end_at", "2025-01-02 01:00:00"], ["updated_at", "2024-11-30 15:45:38.884263"], ["id", 2]]

  def edit
    @schedule = Schedule.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @schedule = Schedule.find(params[:id])
    @schedules_for_date = Schedule.where(date: @schedule.date).order(:start_at)
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."date" = $1 ORDER BY "schedules"."start_at" ASC  [["date", "2024-12-01"]]

  def update
    @schedule = Schedule.find(params[:id])
    @schedule.assign_attributes(schedule_params)
    @schedule.date = @schedule.start_at.to_date if @schedule.start_at.present?

    if @schedule.save
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "schedules" SET "end_at" = $1, "updated_at" = $2 WHERE "schedules"."id" = $3  [["end_at", "2025-01-03 01:00:00"], ["updated_at", "2024-12-02 01:37:34.681342"], ["id", 2]]

  def find_schedule
    @schedule = current_user.schedules.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 5], ["LIMIT", 1]]