app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 5], ["LIMIT", 1]]
---
  def update
        @schedule = current_user.schedules.find(params[:id])

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def destroy
    schedule = current_user.schedules.find_by(id: params[:id])