app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("destination", "start_at", "end_at", "review", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    # @schedule = current_user.schedules.build(schedule_params)
    @planner = Planner.find(params[:planner_id])
    @schedule = @planner.schedules.build(schedule_params)
    @schedule.user = current_user

    if @schedule.start_date.present?
      # @planner = Planner.find_or_create_by(date: @schedule.start_date.to_date)
      @planner = Planner.find_or_create_by(start_date: @schedule.start_date.to_date)

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 12], ["LIMIT", 1]]
---
  def find_schedule
    @schedule = current_user.schedules.find(params[:id])